Revit 2024 API
ExternalResourceTypes.BuiltInExternalResourceTypes.TopographyLink Property
 An external resource type representing Topography Links.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalResourceType TopographyLink { get; }
Visual Basic
Public Shared ReadOnly Property TopographyLink As ExternalResourceType
	Get
Visual C++
public:
static property ExternalResourceType^ TopographyLink {
	ExternalResourceType^ get ();
}
See Also
ExternalResourceTypes.BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace